---
kind: method
id: M:Autodesk.Revit.DB.FabricationConfiguration.AncillaryExists(System.Int32)
source: html/2042758d-e451-923e-82f8-c74a38f30409.htm
---
# Autodesk.Revit.DB.FabricationConfiguration.AncillaryExists Method

Checks to see if the specified ancillary exists.

## Syntax (C#)
```csharp
public bool AncillaryExists(
	int ancillaryId
)
```

## Parameters
- **ancillaryId** (`System.Int32`) - The ancillary identifier.

## Returns
Returns true if the ancillary exists.